In [2]:
import pandas as pd
import numpy as np

In [5]:
# Create sample data
df = pd.DataFrame({
     "Applicant": ["Alice", "Bob", "Carla", "David"],
    "SAT_Score": [1400, 1250, 1580, 1190]})
df

  Applicant  SAT_Score
0     Alice       1400
1       Bob       1250
2     Carla       1580
3     David       1190

In [6]:
#execute a mathematical procedure using a lambda function.
df['SAT_percent'] = df['SAT_Score'].apply(lambda x: (x / 1600) * 100)
df

  Applicant  SAT_Score  SAT_percent
0     Alice       1400       87.500
1       Bob       1250       78.125
2     Carla       1580       98.750
3     David       1190       74.375

In [8]:
#Create a flag column from the text column 
df['High_Achiever'] = df['SAT_Score'].apply(
    lambda x: True if x >= 1400 else False)
df

  Applicant  SAT_Score  SAT_percent  High_Achiever
0     Alice       1400       87.500           True
1       Bob       1250       78.125          False
2     Carla       1580       98.750           True
3     David       1190       74.375          False